const { getRandomInRange, getRandomElement } = require('../util/getRandom');
const { getAgeRange } = require('./userInfoGen');

// 무작위 이름 (다만, 남자, 여자 이름 분리. 무작위로 얻은 성별 및 나이대에 어울리는 이름 선택)
function getRandomName(gender, age) {
  const familyNames = [
    '김', '이', '박', '최', '정', '강', '조', '윤', '장', '임', '한', '오', '서', '신', '권',
    '황', '안', '송', '전', '홍', '유', '고', '문', '양', '손', '배', '조', '백', '허', '유',
    '남', '심', '노', '정', '하', '곽', '성', '차', '주', '우', '구', '신', '임', '전', '민',
    '유', '류', '나', '진', '지', '엄', '채', '원', '천', '방', '공', '강', '현', '함', '변',
    '염', '양', '변', '여', '추', '노', '도', '소', '신', '석', '선', '설', '마', '길', '주',
    '연', '방', '위', '표', '명', '기', '반', '라', '왕', '금', '옥', '육', '인', '맹', '제',
    '모', '장', '탁', '국', '여', '진'
  ];

  // 한 행당 태어난 시대별로 가장 많이 사용된 이름 10개씩
  // 현재가 2025년이라서 인덱스 처리를 위해서 아래 년대 조절 (각각 5년씩 당김)
  const maleNames = [
    '주호', '민규', '하람', '태경', '찬민', '지율', '건호', '도윤', '찬우', '지오', // 10대. 2006년~ 
    '서준', '예준', '하준', '지민', '태윤', '유준', '준우', '윤호', '시우', '건우', // 20대. 1996년~
    '민준', '지호', '현우', '진우', '유민', '승민', '태석', '영진', '성훈', '주영', // 30대. 1986년~ 
    '준호', '태훈', '정수', '재민', '영호', '상훈', '영재', '형준', '도현', '수혁', // 40대. 1976년~ 
    '민수', '영수', '성민', '지훈', '현수', '승규', '동현', '철수', '진수', '재훈'  // 50대. 1966년~ 
  ];

  const femaleNames = [
    '민서', '지유', '유나', '수아', '다영', '지아', '예원', '소율', '가은', '나은', // 10대
    '서연', '서현', '지민', '하은', '주은', '민지', '채원', '하영', '윤아', '지우', // 20대
    '연수', '미영', '보람', '미정', '예진', '시은', '지선', '현경', '소희', '주희', // 30대
    '주미', '지현', '은영', '수현', '혜진', '소영', '정민', '윤정', '선영', '선희', // 40대
    '영희', '지영', '지혜', '은정', '지은', '수진', '지원', '현정', '지연', '유진'  // 50대
  ];

  // 10대(10~19세)이면 배열 인덱스 0~9 / ... / 50대 40~49
  // 50대 랜덤 인덱스 예시: 0~9 사이 무작위 숫자 + 40 ('50'개짜리 배열 인덱스와 매핑하기 위해서 나이대 - '10'살) → 40~49 사이 무작위 인덱스
  const randomIndex = getRandomInRange(0, 9) + (getAgeRange(age) - 10);
  // const randomIndex = Math.floor(Math.random() * 10) + ((Math.floor(age / 10) * 10) - 10);

  return getRandomElement(familyNames) + ((gender == '남성') ? maleNames[randomIndex] : femaleNames[randomIndex]);
  // return familyNames[getRandomInRange(0, 49)] + ((gender.toUpperCase() == '남성') ? maleNames[randomIndex] : femaleNames[randomIndex]);
}
// console.log(getRandomName('Female', 50));

module.exports = { getRandomName };
